Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Automatic response to permanent action warning: Certain actions within a timeline cannot be undone, and when that happens you will recieve a warning message asking you if you want to continue.
zh_cn: 自动响应永久（permanent）动作警告: 时间轴中的某些操作无法撤消，如果发生这种情况，您将收到一条警告消息，询问您是否要继续。

source: Automatic response to proxy file deletion: As above, this controls the message you are shown on deletion of any proxy files.
zh_cn: 自动响应代理文件删除: 如上所述，这将控制删除任何代理文件时是否显示消息。

source: Automatic response to replacing images during strip import - When you select Import Strip from the Image drop down menu, you will get a message warning you that you will be overwriting any images already in the sprite resource, with the option to continue or not.
zh_cn: 自动响应在长带图导入时替换图像 - 当你从 图像 下拉菜单中选择 导入长带图 时，会收到一条消息，警告你将覆盖精灵资源中已有的图像，有继续或不继续两个选项。

source: Automatic response to resetting the project layout: When you select to reset the project layout (from the Layouts Menu) you will, by default, be shown a warning message about how this will close any open resource windows.
zh_cn: 自动响应重置项目布局: 当你选择重启项目布局（从 布局菜单），默认情况下会显示一条警告消息，说明这将如何关闭打开的资源窗口。

source: Automatic response to resource deletion: When you delete a resource from the resource tree you normally get a warning asking if you are sure you want to proceed.
zh_cn: 自动响应资源删除: 从资源树中删除资源时，通常会收到一条警告，询问您是否确定要继续。

source: Automatic response to restarting a running build: When you restart a build and another previous one is still running, you will be asked whether you want to stop the current build first.
zh_cn: 自动响应重新启动正在运行的构建: 当你重新启动一个构建，而另一个之前的构建仍在运行时，将询问你是否希望先停止当前构建。

source: Automatic response to setting a room parent via node drag: When you drag a room over another room in the resource tree and then release it, you will be shown a message asking if you wish to make the room a "child" of the room being dropped on.
zh_cn: 通过节点拖动自动响应设置房间父级: 当您拖动房间到资源树中的另一个房间下，然后释放它，系统将显示一条消息，询问您是否希望让被拖动房间成为拖动位置所在房间的子房间。

source: Automatic response to turning off anonymous statistics: When you disable anonymous game statistics in the General Game options, you will be shown a warning message asking you to consider the option carefully.
zh_cn: 自动响应关闭匿名统计: 当你在 常规游戏选项 中禁用匿名游戏统计信息时，会显示一条警告信息，询问你仔细考虑该选项。

source: Automatic response to updating layer depths - When you change layer depths a message is shown to warn you that doing this will also automatically update all the other layer depths.
zh_cn: 自动响应更新层深度 - 当更改图层深度时，会显示一条消息，提示您这样做也会自动更新其他所有图层的深度。

source: Automatic response to warning when attempting to debug YYC: The YYC target compiles to native code and as such cannot be debugged using the built in debugger.
zh_cn: 尝试调试YYC时自动响应警告: YYC目标编译为本机代码，因此不能使用内置调试器进行调试。

source: Automatically Reload Changed Files: If this is checked then the IDE will automatically scan and check
zh_cn: 自动重新载入变动文件（Automatically Reload Changed Files）：如果该选项被勾选，则IDE会自动扫描并检查

source: Automatically delete IDE cache on close: If this is checked then the IDE compiler cache folder will be removed when you quit GameMaker Studio 2.
zh_cn: 关闭时自动删除IDE缓存目录: 如果勾选此选项，退出 GameMaker Studio 2 时会删除IDE缓存目录。

source: Automatically delete asset cache on close: If this is checked then the asset compiler cache folder will be removed when you quit GameMaker Studio 2.
zh_cn: 关闭时自动删除资产缓存目录: 如果勾选此选项，退出 GameMaker Studio 2 时会删除资产编译器缓存目录。

source: Automatically delete temp directory on close: Checking this will force GameMaker Studio 2 to automatically delete the Temp folder that it creates per project for compiling etc...
zh_cn: 关闭时自动删除临时目录: 勾选此选项 GameMaker Studio 2 会自动删除临时目录（如：编译等）。

source: Automatically enable source control: When this is checked, source control will be enabled for all new projects automatically.
zh_cn: 自动启用源码控制: 选中此项，将自动为所有新项目启用源代码管理。

source: Automatically open source control output window: When this is checked, the source control output window will be shown automatically when something changes.
zh_cn: 自动打开源码控制输出窗口: 勾选此选项，在某些修改时源码控制输出窗口会自动打开。

source: Automatically open syntax error window on detection: Enable or disable syntax error notification when compiling.
zh_cn: 在错误检测时自动打开语法错误窗口: 编译时启用或禁用语法错误通知。

source: Automatically pop up Syntax Errors when an error occurs: Enable or disable syntax error notification when compiling.
zh_cn: 当错误发生时自动弹出语法错误（Automatically pop up Syntax Errors when an error occurs）：编译时启用或禁用语法错误通知。

source: Automatically reload changed files: If this is checked then the IDE will automatically scan and check files to see if any of them have been changed outside of GameMaker Studio 2 and reload them if they have.
zh_cn: 自动重新加载更改的文件: 如果勾选该选项，IDE将自动扫描并检查文件是否在 GameMaker Studio 2 之外的位置被修改，如果是则重新加载它们。

source: Background Image: This is the image file that will be used as the background for the different Workspaces.
zh_cn: 背景图（Background Image）：该选项是被用于各个工作区下作为背景的图像文件。

source: Background colour in editor: While editing a sprite frame the image may be scaled in or out or may not fit the whole drawing in window, in which case a background colour will be shown which you can set here.
zh_cn: 编辑器的背景色（Background colour in editor）：当编辑精灵帧的时候，图像可能会被放大或缩小，并且可能不会适应窗口中的整个绘制区域，在这种情况下，就会显示你所设置的背景色。

source: Background framerate (%): The base IDE framerate modifier when GameMaker Studio 2 is not in focus (regardless of the power supply).
zh_cn: 应用失去焦点时的背景帧率（%）: 当 GameMaker Studio 2 失去焦点时IDE的频率。

source: Background: This section permits you to set the background colour for the main asset nodes in the Resource Tree.
zh_cn: 背景: 此部分允许您设置资源树中主要资源节点的背景颜色。

source: Battery power framerate (%): The base IDE framerate modifier when using battery to power the machine.
zh_cn: 使用电池时帧率（%）: 当使用电池供电时，IDE的帧率。

source: Be careful with your while loops! You can easily make infinite loops, in which case your game will hang and not react to any user input anymore.
zh_cn: 请小心你的while循环！ 它很容易就能造成无限循环，在这种情况下你的游戏将被挂起并且不再响应任何的用户输入。

source: Canvas block size - When you have selected Block Pattern for the background, you can set the size of the individual block here.
zh_cn: 透明背景块大小（块图案样式） - 当你的背景选择为方块图案时，可以在此处设置方块的大小。

source: Canvas primary colour - If you have Single Colour chosen for the background, then the colour used is this one.
zh_cn: 透明背景颜色 1 - 如果选择了单色模式，可以在这里选择单色的颜色。

source: Canvas secondary colour (block pattern style) - If you have Block Pattern chosen for the background, then the colour used to alternate with colour 1 (above) is this one.
zh_cn: 透明背景颜色 2（块图案样式） - 如果选择了方块图案，那么与颜色 1 交替使用的颜色就是该颜色。

source: Canvas style - Here you set the "style" for the background, which can either be "Block Pattern" or "Single Colour".
zh_cn: 透明背景样式（Canvas） - 设置背景的“样式”，可以为 "方块图案" 或 "单色模式"。

source: Certificate File: This section is where you specify the *.pem file that the Marketplace uses for certification of assets.
zh_cn: 证书文件（Certificate File）：这个部分是你所指定给市场用于资源认证的*.pem文件。

source: Certificate Password: Here you must give a unique password for the certificate file to be created.
zh_cn: 证书密码（Certificate Password）：在这里，你必须为即将创建的证书设置一个独立的密码。

source: Certificate Password: Here you must input the certificate password for the file selected above.
zh_cn: 证书密码（Certificate Password）：在此处你必须输入上面所选文件的认证密码。

source: Chain Minimum Alpha: Sets the final alpha value after the fade out falloff point for the chain alpha.
zh_cn: 连接线最小 Alpha 值: 设置在淡出衰减点之后的最终alpha值。

source: Chain fade out start distance (px): Sets the distance from the parent window for the chain link to fade out from.
zh_cn: 连接线淡出开始距离（像素）: 设置从连接的父窗口到开始淡出的距离。

source: Chain fade out stop distance (px): Sets the distance from the parent window for the chain link to end fading out to.
zh_cn: 连接线淡出停止距离（像素）: 设置从连接的父窗口到结束淡出的距离。

source: Change Event - Change the event.
zh_cn: 更改事件 - 更改事件。

source: Check: Once you have filled in the above fields you should click this button to ensure that the password and file selection are correct and work together.
zh_cn: 检查（Check）：一旦你已经填入了上述字段，你应该点击这个按钮来确保密码和所选文件是否正确以及是否能够一起运作。

source: Clean - GameMaker Studio 2 keeps a cache of files to help speed up compile time when testing.
zh_cn: 清除 - 测试时 GameMaker Studio 2 会保存缓存文件以帮助加速编译。

source: Clear output window on compile start: By default the compiler window will clear all previous messages from the compile output window at the start of each build, however un-checking this will maintain previous compiler logs.
zh_cn: 编译开始时清除输出窗口: 默认情况下编译器窗口会在每次构建开始时清除之前的编译输出窗口的所有信息，但是取消勾选此选项可以保留之前的编译器日志。

source: Clear output window on compile: By default the compiler window will clear all previous messages from the compile output window at the start of each build, however un-checking this will maintain previous compiler logs.
zh_cn: 编译时清空输出窗口（Clear output window on compile）：默认地，编译窗口会在每次开始构建的时候清空窗口，而解除此项会保留之前的编译日志。

source: Code Completion Delay (ms) - The delay time (in milliseconds)
zh_cn: 代码补全延迟（毫秒） - 延迟的时间（毫秒）

source: Colour Applied To Active Anchor Points - The colour to be used to draw the anchor points that are active.
zh_cn: 激活的锚点的颜色（Colour Applied To Active Anchor Points） - 用于绘制激活的锚点的颜色。

source: Colour Applied To Active Invalid Anchor Points - The colour to be used to draw the anchor points that are active but invalid.
zh_cn: 活跃却无效的锚点的颜色（Colour Applied To Active Invalid Anchor Points） - 用于绘制激活但是无效的锚点的颜色。

source: Colour Applied To An Invalid Path - The colour to be used to highlight a path that is not valid.
zh_cn: 用于一个无效路径的颜色（Colour Applied To An Invalid Path） - 用于高亮无效路径的颜色。

source: Colour Applied To Anchor Points - The colour to be used to draw the path anchor points.
zh_cn: 锚点的颜色（Colour Applied To Anchor Points） - 用于绘制路径锚点的颜色。

source: Colour Applied To Highlighted Anchor Points - The colour to be used to draw the path anchor points that have been highlighted (selected).
zh_cn: 高亮锚点的颜色（Colour Applied To Highlighted Anchor Points） - 用于绘制高亮的锚点的颜色（选中）。

source: Colour Applied To Highlighted Path Segments - The colour to be used to highlight any selected path segments.
zh_cn: 应用于高亮路径节点的颜色（Colour Applied To Highlighted Path Segments） - 用于高亮任何选中的路径节点的颜色。

source: Colour Applied To Invalid Anchor Points - The colour to be used to draw the path anchor points.
zh_cn: 无效锚点的颜色（Colour Applied To Invalid Anchor Points） - 用于绘制无效路径锚点的颜色。

source: Colour Applied To Invalid Highlighted Anchor Points - The colour to be used to draw the anchor points that are highlighted but invalid.
zh_cn: 应用于无效的高亮锚点的颜色（Colour Applied To Invalid Highlighted Anchor Points） - 用于绘制高亮但却是无效的锚点的颜色。

source: Colour Applied To The Path - The colour to be used to show the path as you edit it.
zh_cn: 应用到路径的颜色（Colour Applied To The Path） - 编辑时，显示路径用的颜色。

source: Colour coding/code completion for obsolete functions: This will highlight any section of code that is obsolete.
zh_cn: 为含有弃用的内容的代码提供语法高亮和自动补全：这将突出显示代码中的过时函数。

source: Colour of control lines - Set the colour for the lines linking the control points to the nodes.
zh_cn: 控制线颜色（Colour of control lines） - 设置控制点与节点的连接线颜色。

source: Colour of control points - Set the colour for each of the control point "handles" on a node.
zh_cn: 控制点颜色（Colour of control points） - 设置一个样条曲线上的“手柄调控点”颜色。

source: Colour of nodes - Set the colour for the different nodes on the spline/arc.
zh_cn: 节点颜色（Colour of nodes） - 设置样条/弧线上各个路径节点的颜色。

source: Colour of selected nodes - Set the colour to be used for any selecetd nodes on the spline/arc.
zh_cn: 选中的节点颜色（Colour of selected nodes） - 设置样条/弧线上所有被选中的节点的颜色。

source: Colour: The default colour for the text being written to the window.
zh_cn: 颜色（Colour）：文本被写入该窗口所使用的默认颜色。

source: Configurations - 0
zh_cn: 配置（Configuration） - 0

source: Control key must be held down for mouse wheel zoom: When this is checked all editors (and the main workspace) will have zoom enabled with + the mouse wheel , while un-checking it will enable zoom with only the mouse wheel .
zh_cn: 必须按下Ctrl键来进行滚轮缩放（Control key must be held down for mouse wheel zoom）：当勾选此项时，所有编辑器以及工作区都必须使用+鼠标滚轮才能进行缩放，而解除此项则只需要鼠标滚轮就能进行缩放了。

source: Control point colour - Set the colour for each of the control point "handles" on an anchor point.
zh_cn: 控制点颜色 - 设置每个控制点“手柄”的颜色。

source: Convert To Drag and Drop / Code - Object events will be created using the method chosen when you created the project, either using code or using Drag and Drop actions.
zh_cn: 转换为拖放/代码 - 使用代码或使用拖放操作创建项目时使用的方法创建对象事件。

source: Create Executable - This will compile the current project and create an executable file (or files) for the target platform.
zh_cn: 创建可执行文件（Create Executable） - 这将为目标平台编译当前项目并创建可执行文件。

source: Create Package - With this option you can open the Create Package Wizard to create a new asset package or tutorial for the Marketplace.
zh_cn: 创建资源报（Create Package） - 使用该选项你可以打开 资源包创建向导（Create Package Wizard）来为市场创建一个新的资源包或教程。

source: Create - Create a new resource of the type you have clicked on to open the menu.
zh_cn: 创建 - 创建您打开菜单所点击类型的新资源。

source: Current Runtime Release Notes - Since the Runtime can update independently of the IDE, it has its own set of Runtime Release Notes.
zh_cn: 当前运行库版本说明 - 由于运行库可独立于IDE进行更新，因此它有自己的一套 运行库发行说明。

source: Cut / Copy / Paste Events - Cut, copy or paste the selected event.
zh_cn: 剪切/复制/粘贴事件 - 剪切，复制或粘贴所选事件。

source: Cyan - The text rendering time
zh_cn: 青色 - 文字呈现时间

source: DPI Override: This option lets you override the default DPI setting with your own.
zh_cn: DPI改写（DPI Override）：该选项允许用你自己的分辨率设定去覆盖默认分辨率设定。

source: Dark Red - The GPU flush, which is how long the GPU takes to clear images from memory
zh_cn: 深红色 - GPU 刷新，即 GPU 从存储器中清除图像所需的时间

source: Debug: From here you can pause or play the game being debugged, or you can toggle a breakpoint on or off.
zh_cn: Debug:在这里你可以暂停或者启动你正在调试的游戏，或者你也可以把断点切换成打开或者关闭的状态。

source: Debug - Run your current project for testing with the debugger so that you can see detailed performance information and debug any errors or issues you may have.
zh_cn: 调试 - 使用调试器调试运行你当前的项目，以便你可以看到详细的性能信息，并且调试任何错误及可能的问题。

source: Debugger port: This sets the port number for the Debug Module to use.
zh_cn: 调试端口: 设置调试模块使用的端口号。

source: Default Animation Mode For New Sprites: This option permits you to set the default animation mode for sprites in the sprite editor.
zh_cn: 新的精灵的默认动画模式（Default Animation Mode For New Sprites）：此选项允许你在精灵编辑器中设置默认的动画模式。

source: Default Audio Device: Here you can choose the default audio device for the GameMaker Studio 2 IDE to use.
zh_cn: 默认音频设备：在此处你可以选择GameMaker Studio 2 IDE所使用的默认音频设备

source: Default For Exit Confirmation: This option permits you to set whether a confirmation message should be shown when you exit GameMaker Studio 2.
zh_cn: 退出确认时默认（Default For Exit Confirmation）：该选项允许你设置在退出GameMaker Studio 2时是否显示确认信息。

source: Default For File Deletion: The default setting here is to show a message asking if you are sure you want to delete, but you can set this to "OK" so that all deletions are completed without this message as if you'd clicked okay already.
zh_cn: 文件删除时默认进行（Default For File Deletion）：此处的默认选项是显示消息并询问你是否希望进行删除，但如果你将这项置为“OK”，那么删除时不会显示这个消息，就好像你已经点过确认按钮一样。

source: Default For Proxy Deletion: As above, this controls the message you are shown on deletion of any proxy files.
zh_cn: 代理文件删除时默认进行（Default For Proxy Deletion）：同上，该项控制在删除代理文件时是否显示消息。

source: Default Loop Mode: The loop button in the Image Editor can be set to function in two different modes: either play once, where the animation will stop when it gets to the last frame, loop from the start, where the animation will go back to the first frame when it finishes, or ping pong, where the animation will go up through the images to the end and then back down through them again to the beginning.
zh_cn: 默认循环模式（Default Loop Mode）：图像编辑器中的循环按钮可以设置两种功能模式：一种是单次播放（Play Once），这种情况下动画会在到达最后一帧时停止；另一个是从起点开始循环（Loop from the start），这种情况下动画会在结束后回到起点并继续播放；还有一个是往返播放（Ping pong），这种情况下动画会从头播放到尾再倒过来播放一遍回到开始。

source: Default Origin For New Sprites: This option permits you to set the default origin position for any new sprite resources that you create.
zh_cn: 新的精灵的默认原点（Default Origin For New Sprites）：这个选项允许你为任何新创建的精灵设置默认的原点位置。

source: Default choice for resetting the project layout: When you select to reset the project layout (from the Layouts Menu) you will, by default, be shown a warning message about how this will close any open resource windows.
zh_cn: 重置工程布局的默认选择（Default choice for resetting the project layout）当你（从布局菜单（Layouts Menu））选择重置工程布局时，默认地会显示一个警告消息告诉你该操作将会关闭所有打开的资源窗口。

source: Default code window height - Set the default height (in pixels) for the code window to be when opened.
zh_cn: 默认代码窗口高度 - 设置当代码编辑器窗口打开时的默认高度（像素）。

source: Default code window width - Set the default width (in pixels) for the code window to be when opened.
zh_cn: 默认代码窗口宽度 - 设置当代码编辑器窗口打开时的默认宽度（像素）。

source: Default event content: Here you can edit the comments that are added by default in the code window for new events.
zh_cn: 默认的事件内容: 在这里你可以编辑被添加到新事件的代码编辑器窗口的默认注释。

source: Default for Drag and Drop conversion to code: You can use the right mouse button within the Drag and Drop workspace to select the option to turn all Drag and Drop for that event into GML code.
zh_cn: 默认设置DnD转换为代码（Default for Drag and Drop conversion to code）：你可以在DnD（ Drag and Drop）工作区使用鼠标右键 选择选项将所有的DnD事件转换为GML代码。

source: Default for automatically updating layer depths - When you change layer depths a message is shown to warn you that doing this will also automatically update all the other layer depths.
zh_cn: 默认自动更新层深度（Default for automatically updating layer depths） - 当你更改层深度时，将会显示一条消息，警告你这样做也将会自动更新其它所有层的深认。

source: Default for closing non-empty workspace tab using keyboard shortcut: The keyboard shortcut mentioned above can be used to close any open tab, but sometimes you may accidentally close an empty tab that you require.
zh_cn: 使用快捷键关闭非空工作区标签页时的默认处理（Default for closing non-empty workspace tab using keyboard shortcut）：前面所说的的键盘快捷键可以用来关闭任何打开的标签页，但有时候你可能会不小心关掉你所需要的标签页。

source: Default for committing changes on tool change - When you change draw tools after editing a frame, by default a message shows to ask if you want to commit the changes made.
zh_cn: 工具更改时提交修改的默认处理（Default for committing changes on tool change） - 当你在（使用样条工具等）编辑一帧之后更改绘制工具，默认地会显示一个消息去询问你是否要提交当前的变动。

source: Default for deleting frames - When you delete a frame by default a message shows to ask if you are sure you want to do this.
zh_cn: 删除帧时默认处理（Default for deleting frames） - 当你删除一个帧的时候，会默认地显示一个消息询问你是否确定要做这件事。

source: Default for opening multiple resources: As mentioned above in the general Resource Tree preferences, when you open multiple resources at once from the resource tree, you can get a warning if the number exceeds the number specified.
zh_cn: 打开多个资源的默认设置（Default for opening multiple resources）：就如上面提到的，在资源树的基本偏好设置中，同时打开的超过指定的数目你会获得一个警告。

source: Default for parent room item deletion - Here you can choose what happens when you delete an item that is part of a parent room (and so present in all child rooms).
zh_cn: 默认为删除父房间项目（Default for parent room item deletion） - 在这里你可以选择当你删除的项目是父房间的一部分时（会出现在所有的子房间内）会发生什么。

source: Default for parent room layer deletion - Here you can choose what happens when you delete a layer that is part of a parent room (and so present in all child rooms).
zh_cn: 默认删除父房间层（Default for parent room layer deletion） - 在这里你可选择当你删除一个层，而它是一个父房间的一部分时（因此存在于所有的子房间），会发生什么。

source: Default for replacing images on strip import - When you select Import Strip from the Image drop down menu, you will get a message warning you that you will be overwriting any images already in the sprite resource, with the option to continue or not.
zh_cn: 在导入长带图时候替换图像的默认处理（Default for replacing images on strip import） - 当你在图像（Image）下拉菜单中选择导入长带图（Import Strip）时，你会得到一个消息警告你这样会覆盖精灵资源中现存的所有图像，并提供给你两个选项选择继续进行还是不继续。

source: Default for resource deletion: When you delete a resource from the resource tree you normally get a warning asking if you are sure you want to proceed.
zh_cn: 删除资源的默认设置（Default for resource deletion）：当你删除资源树的一个资源，通常你会得到一个警告，询问你是否想要继续。

source: Default for restarting a running build: When you restart a build and another previous one is still running, you will be asked whether you want to stop the current build first.
zh_cn: 重新运行生成项时的默认处理（Default for restarting a running build）：当你在上一个生成版本还在运行的时候你重新开始生成时，你会被询问是否想要先中止当前的生成版本。

source: Default height of a new room: Sets the initial height that will be selected as the default for a new room.
zh_cn: 新房间的默认高度（Default height of a new room）：设置初始高度也将作为新创建房间的默认高度。

source: Default layer depth spacing: When you create multiple layers in the room editor they are automatically assigned a depth based on their position within the layer list.
zh_cn: 默认层深度间距: 当您在场景编辑器中创建多个层时，将根据层在列表中的位置自动分配深度。

source: Default message for converting Drag and Drop to GML: When you convert a Drag and Drop event or script into GML code, you will by default get a message warning you about what you are about to do and asking if you want to continue.
zh_cn: 转换拖拽按钮为GML时默认该消息（Default message for converting Drag and Drop to GML）：当你酱拖拽按钮事件或脚本转换为GML代码时，默认地你会得到一个关于你要做什么并且询问你是否继续的警告消息。

source: Default room height: Sets the initial height that will be selected as the default for a new room.
zh_cn: 默认房间高度: 设置新场景的初始高度。

source: Default room width: Sets the initial width that will be selected as the default for a new room.
zh_cn: 默认房间宽度: 设置新场景的初始宽度。

source: Default size for DnD™ toolbox action thumbnails: This setting will be used to define the default size for all action icons in the toolbox (default 32px).
zh_cn: DnD™ 工具栏动作缩略图的默认尺寸: 这项设定将被用于定义工具栏中所有动作图标的默认大小（默认为32像素）。

source: Default size of toolbox Action thumbnails: This setting will be used to define the default size for all action icons in the toolbox (default 32px).
zh_cn: 工具箱中动作按钮缩略图的默认尺寸（Default size of toolbox Action thumbnails）：这个设置用于定义工具箱中所有动作图标的默认大小。（默认为32像素）

source: Default sprite animation mode: This option permits you to set the default animation mode for sprites in the sprite editor.
zh_cn: 默认精灵动画模式: 该选项允许您在精灵编辑器中为精灵设置默认动画模式。

source: Default sprite collision mask kind: This option permits you to set the default kind of collision mask to use for new sprites.
zh_cn: 默认精灵碰撞盒类型: 此选项允许你设置用于新精灵的默认碰撞盒类型。

source: Default sprite height: This option permits you to set the default height for all new sprites created in the sprite editor.
zh_cn: 默认精灵高度: 此选项允许您设置在精灵编辑器中创建的所有新精灵的默认高度。

source: Default sprite origin: This option permits you to set the default origin position for any new sprite resources that you create.
zh_cn: 默认精灵原点: 此选项允许您为创建的所有新精灵资源设置默认的起始位置。

source: Default sprite width: This option permits you to set the default width for all new sprites created in the sprite editor.
zh_cn: 默认精灵宽度: 此选项允许您设置在精灵编辑器中创建的所有新精灵的默认宽度。

source: Default width of a new room: Sets the initial width that will be selected as the default for a new room.
zh_cn: 新房间的默认宽度（Default width of a new room）：设置初始的宽度作为新房间默认宽度。

source: Default zoom (%): This sets the default zoom percentage for the resource tree when you start a new project.
zh_cn: 默认缩放（%）: 设置启动新项目时资源树的默认缩放百分比。

source: Delete Asset Cache On Quit: If this is checked then the asset compiler cache folder will be removed when you quit GameMaker Studio 2.
zh_cn: 退出时删除资源缓存（Delete Asset Cache On Quit）：如果勾选此项，则在你退出GameMaker Studio 2时候删除资源编译器缓存。.

source: Delete Asset Cache: Clicking this button will delete the compiler asset cache for the project.
zh_cn: 删除资产缓存：点击该按钮将会删除该工程的资源缓存。

source: Delete Event - Delete the event (or events).
zh_cn: 删除事件 - 删除事件（或事件）。

source: Delete IDE Cache: Clicking this button will delete the IDE cache.
zh_cn: 删除IDE缓存: 点击该按钮将会删除IDE缓存。

source: Delete Temp Folder: Clicking this button will delete the temp folder for the project.
zh_cn: 删除临时目录：点击该按钮将会删除该工程的临时文件夹。

source: Delete - Delete the resource from the project (this will completely remove it, unless you are in a project view other than the default - see below).
zh_cn: 删除 - 从项目中删除资源（将会完全删除，除非 您在设置中修改了默认值- 请参见下文）。
